<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Document sans nom</title>
<link href="../doc.css" rel="stylesheet" type="text/css" media="all" />
</head>
<body>
<hr />
<p>Ce module que l&#39;on pourrait qualifier de module de sites  <strong>"Vitrine"</strong> ou de <strong>couteau suisse</strong> des modules est un module de publication de pages ind&eacute;pendantes ou non.</p>
<h2>Site vitrine</h2>
<p>Si vous souhaitez r&eacute;aliser un site pour &ecirc;tre pr&eacute;sent sur internet et pr&eacute;senter votre activit&eacute; (commerce, profession lib&eacute;rale, etc...) ce module associ&eacute; &agrave; un module contact et un module de plan de site (pour le r&eacute;f&eacute;rencement) est tout &agrave; fait &agrave; m&ecirc;me de remplir cette t&acirc;che.</p>

<h2>Couteau suisse</h2>


<p>Il vous permet par exemple d&#39;int&eacute;grer dans votre site :
<ul>
	<li>une page compl&egrave;te sur votre gestion des donn&eacute;es priv&eacute;es de vos visiteurs ou membres</li>
	<li>le r&egrave;glement de votre site</li>
	<li>la pr&eacute;sentation des activit&eacute;s de votre entreprise. Dans la r&eacute;alisation d&#39;un site vitrine c&#39;est tr&egrave;s souvent le module principal sur lequel repose le site.</li>
</ul>

<h2>Avantages</h2>
<ul>
	<li>Les donn&eacute;es publi&eacute;es dans ces pages sont accessibles par le syst&egrave;me de recherche de xoops.</li>
	<li>simplicit&eacute; d&#39;utilisation : le module supporte le langage html, mais pourvu de plusieurs &eacute;diteurs wisiwig, on &eacute;crit et on publie, c&#39;est tout </li>
	<li>possibilit&eacute; que chaque page soit automatiquement ajout&eacute;e comme sous-lien dans le bloc menu principal</li>
	<li>permet de publier tout ce qui ne rentre pas dans les autres modules xoops</li>
	<li>int&eacute;gration du hack titre des pages pour que chaque page ait un titre diff&eacute;rent </li>
	<li>inclusion du moteur metagen : la fonction Metagen permet d&#39;am&eacute;liorer le r&eacute;f&eacute;rencement des pages qui utilisent ce proc&eacute;d&eacute; en alimentant la balise Meta-Keywords &agrave; partir du contenu de celles-ci</li>
    <li>support des flux rss pour vos pages et/ou possibilit&eacute; de les ins&eacute;rer sur un autre site avec un script javascript</li>
</body>
</html>
